import numpy as np

mu = 0.01215  # 地月系统无量纲质量参数
T_max = 50e-3  # 最大推力 (N)
I_sp = 3800    # 比冲 (s)
g0 = 9.81      # 重力加速度 (m/s^2)
c = I_sp * g0  # 排气速度 (m/s)

# TCA时刻状态 (来自论文 Table 2)
r_pc_tca = np.array([0.9708918431, 0.08693169497, -0.0141139994])
v_pc_tca = np.array([0.1486521434, -0.2247801445, 0.3899588750])
r_sc_tca = np.array([0.9708920000, 0.08693169497, -0.0141139994])
v_sc_tca = np.array([0.148652143405387, 0.1500000000, -0.3100000000])

S_A = 25 + 4.7  # 等效半径之和 (km)
C_b = np.array([[2.686552e-2, 0], [0, 7.205562e-2]])  # B平面协方差矩阵
sigma = np.sqrt(C_b[0, 0] * C_b[1, 1])